In [1]:
import sqlite3

In [2]:
conn=sqlite3.connect('INSTRUCTOR.db')

In [4]:
cursor_obj=conn.cursor()

In [6]:
cursor_obj.execute("DROP TABLE IF EXISTS INSTRUCTOR")

In [8]:
table="create table if not exists INSTRUCTOR(id integer primary key not null,fname varchar(15),lname varchar(15),city varchar(20),ccode char(2));"
cursor_obj.execute(table)
print("Table is ready")

Table is ready

In [10]:
cursor_obj.execute("insert into instructor values (1, 'Rav', 'Ahuja', 'TORONTO', 'CA')")

In [11]:
cursor_obj.execute('''insert into INSTRUCTOR values (2, 'Raul', 'Chong', 'Markham', 'CA'), (3, 'Hima', 'Vasudevan', 'Chicago', 'US')''')

In [13]:
cursor_obj.execute("select * from instructor")
output_all=cursor_obj.fetchall()
for row in output_all:
    print(row)

(1, 'Rav', 'Ahuja', 'TORONTO', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')
(3, 'Hima', 'Vasudevan', 'Chicago', 'US')

In [14]:
cursor_obj.execute("select * from instructor")
output=cursor_obj.fetchmany(2)
for row in output:
    print(row)

(1, 'Rav', 'Ahuja', 'TORONTO', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')

In [16]:
cursor_obj.execute("select fname from instructor")
output_all=cursor_obj.fetchall()
for row in output_all:
    print(row)

('Rav',)
('Raul',)
('Hima',)

In [18]:
cursor_obj.execute("update INSTRUCTOR set CITY='MOOSETOWN' where FNAME='Rav'")
cursor_obj.execute("select * from instructor")
output_all=cursor_obj.fetchall()
for row in output_all:
    print(row)

(1, 'Rav', 'Ahuja', 'MOOSETOWN', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')
(3, 'Hima', 'Vasudevan', 'Chicago', 'US')

In [19]:
#retrive data into pandas
import pandas as pd
df=pd.read_sql_query("select * from instructor",conn)
df

   id fname      lname       city ccode
0   1   Rav      Ahuja  MOOSETOWN    CA
1   2  Raul      Chong    Markham    CA
2   3  Hima  Vasudevan    Chicago    US

In [20]:
conn.close()